In [4]:
import numpy as np
A=np.array([1,2,3])
A

array([1, 2, 3])

In [5]:
np.array([[1,2,3],[4,5,6],[7,8,9]])

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [6]:
A+A

array([2, 4, 6])

In [7]:
A*A

array([1, 4, 9])

In [8]:
B=np.array([[1],[2],[3]])#IF WE WANT A COLUMN
B

array([[1],
       [2],
       [3]])

In [9]:
np.arange(0,10)

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [10]:
np.arange(0,101,2)

array([  0,   2,   4,   6,   8,  10,  12,  14,  16,  18,  20,  22,  24,
        26,  28,  30,  32,  34,  36,  38,  40,  42,  44,  46,  48,  50,
        52,  54,  56,  58,  60,  62,  64,  66,  68,  70,  72,  74,  76,
        78,  80,  82,  84,  86,  88,  90,  92,  94,  96,  98, 100])

In [11]:
np.zeros(6)

array([0., 0., 0., 0., 0., 0.])

In [12]:
np.ones((4,10))

array([[1., 1., 1., 1., 1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1., 1., 1., 1., 1.]])

In [13]:
np.eye(4)

array([[1., 0., 0., 0.],
       [0., 1., 0., 0.],
       [0., 0., 1., 0.],
       [0., 0., 0., 1.]])

In [14]:
np.linspace(0, 5, 10)

array([0.        , 0.55555556, 1.11111111, 1.66666667, 2.22222222,
       2.77777778, 3.33333333, 3.88888889, 4.44444444, 5.        ])

In [15]:
data = np.array([[1, 2, 3, 4], [5, 6, 7, 8]])
data

array([[1, 2, 3, 4],
       [5, 6, 7, 8]])

In [16]:
data[1]

array([5, 6, 7, 8])

In [17]:
data[1, 3]

8

In [18]:
np.random.rand(2,2)

array([[0.47185938, 0.90193397],
       [0.8564118 , 0.4831312 ]])

In [19]:
np.random.randn(5,5)

array([[-0.21627916,  0.36307098, -0.19075915, -0.97995793,  0.75642723],
       [ 0.29673158, -1.16301391, -1.04365437,  2.00208779, -2.43248402],
       [ 0.51618534, -3.33107875, -1.89110149, -0.4736023 , -0.66041993],
       [ 0.41792213, -1.70694928, -0.23573129,  0.48506149,  0.76293683],
       [ 1.59199612, -0.22135545,  1.26089304,  0.33535107,  1.08420294]])

In [20]:
import pandas as pd

In [21]:
ser = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])
ser

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [22]:
df = pd.DataFrame(np.random.randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A -2.182140 -1.527048  0.574285  1.498304
B  0.366144 -1.361376  0.497989 -0.839940
C -0.419372  2.012536 -0.565813 -1.191881
D  0.513427  1.491479 -1.519141 -0.684977
E -0.270719  1.201782 -0.452686  0.551176

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      float64
 1   X       5 non-null      float64
 2   Y       5 non-null      float64
 3   Z       5 non-null      float64
dtypes: float64(4)
memory usage: 200.0+ bytes

In [24]:
df.head()

          W         X         Y         Z
A -2.182140 -1.527048  0.574285  1.498304
B  0.366144 -1.361376  0.497989 -0.839940
C -0.419372  2.012536 -0.565813 -1.191881
D  0.513427  1.491479 -1.519141 -0.684977
E -0.270719  1.201782 -0.452686  0.551176

In [25]:
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A -2.182140 -1.527048  0.574285  1.498304 -1.607856
B  0.366144 -1.361376  0.497989 -0.839940  0.864133
C -0.419372  2.012536 -0.565813 -1.191881 -0.985186
D  0.513427  1.491479 -1.519141 -0.684977 -1.005714
E -0.270719  1.201782 -0.452686  0.551176 -0.723405

In [26]:
df.drop('new',axis=1)
df

          W         X         Y         Z       new
A -2.182140 -1.527048  0.574285  1.498304 -1.607856
B  0.366144 -1.361376  0.497989 -0.839940  0.864133
C -0.419372  2.012536 -0.565813 -1.191881 -0.985186
D  0.513427  1.491479 -1.519141 -0.684977 -1.005714
E -0.270719  1.201782 -0.452686  0.551176 -0.723405

In [27]:
df.drop('new',axis=1, inplace = True ) # inplace = False by default 永久置換
df

          W         X         Y         Z
A -2.182140 -1.527048  0.574285  1.498304
B  0.366144 -1.361376  0.497989 -0.839940
C -0.419372  2.012536 -0.565813 -1.191881
D  0.513427  1.491479 -1.519141 -0.684977
E -0.270719  1.201782 -0.452686  0.551176

In [28]:
df.rename(index={'A':'CA', 'B':'NY', 'C':'WY', 'D':'OR', 'E':'CO'}, inplace=True)
df

           W         X         Y         Z
CA -2.182140 -1.527048  0.574285  1.498304
NY  0.366144 -1.361376  0.497989 -0.839940
WY -0.419372  2.012536 -0.565813 -1.191881
OR  0.513427  1.491479 -1.519141 -0.684977
CO -0.270719  1.201782 -0.452686  0.551176

In [29]:
df['V'] = [1, 2, np.nan, np.nan, 5]
df

           W         X         Y         Z    V
CA -2.182140 -1.527048  0.574285  1.498304  1.0
NY  0.366144 -1.361376  0.497989 -0.839940  2.0
WY -0.419372  2.012536 -0.565813 -1.191881  NaN
OR  0.513427  1.491479 -1.519141 -0.684977  NaN
CO -0.270719  1.201782 -0.452686  0.551176  5.0

In [30]:
df.isnull()

        W      X      Y      Z      V
CA  False  False  False  False  False
NY  False  False  False  False  False
WY  False  False  False  False   True
OR  False  False  False  False   True
CO  False  False  False  False  False

In [31]:
df.isnull().sum()

W    0
X    0
Y    0
Z    0
V    2
dtype: int64

In [32]:
df.isnull().sum().sum()

2

In [33]:
df.dropna()

           W         X         Y         Z    V
CA -2.182140 -1.527048  0.574285  1.498304  1.0
NY  0.366144 -1.361376  0.497989 -0.839940  2.0
CO -0.270719  1.201782 -0.452686  0.551176  5.0

In [34]:
df.fillna(value = 'replace')

           W         X         Y         Z        V
CA -2.182140 -1.527048  0.574285  1.498304        1
NY  0.366144 -1.361376  0.497989 -0.839940        2
WY -0.419372  2.012536 -0.565813 -1.191881  replace
OR  0.513427  1.491479 -1.519141 -0.684977  replace
CO -0.270719  1.201782 -0.452686  0.551176        5

作業一

In [50]:
hf = pd.DataFrame(data=[[90, 60, 33], [50, 70, 75], [70, 90, 88], [80, 50, 60]],columns='Math English History'.split(),index='Simon Allen Jimmy Peter'.split())
hf#第一題

       Math  English  History
Simon    90       60       33
Allen    50       70       75
Jimmy    70       90       88
Peter    80       50       60

In [55]:
bf=hf[hf['English']>85]
cf=bf[bf['Math']>60]
cf#第二題

       Math  English  History
Jimmy    70       90       88

In [57]:
hf.mean()#第三題

Math       72.5
English    67.5
History    64.0
dtype: float64

In [64]:
hf.sort_values(by=['Math'])#第四題

       Math  English  History
Allen    50       70       75
Jimmy    70       90       88
Peter    80       50       60
Simon    90       60       33

In [65]:
hf.sort_values(by=['English'])

       Math  English  History
Peter    80       50       60
Simon    90       60       33
Allen    50       70       75
Jimmy    70       90       88

In [66]:
hf.sort_values(by=['History'])

       Math  English  History
Simon    90       60       33
Peter    80       50       60
Allen    50       70       75
Jimmy    70       90       88

In [69]:
hf['Gender'] = ['M','F','M','M']
hf#第五題

       Math  English  History Gender
Simon    90       60       33      M
Allen    50       70       75      F
Jimmy    70       90       88      M
Peter    80       50       60      M

In [82]:
result = pd.value_counts(['M','F','M','M'])
result#第六題

M    3
F    1
dtype: int64

In [97]:
hf['mean']=hf.mean(1)
hf#第七題

       Math  English  History Gender       mean
Simon    90       60       33      M  61.000000
Allen    50       70       75      F  65.000000
Jimmy    70       90       88      M  82.666667
Peter    80       50       60      M  63.333333

In [98]:
hf.sort_values(by=['mean'])第八題

       Math  English  History Gender       mean
Simon    90       60       33      M  61.000000
Peter    80       50       60      M  63.333333
Allen    50       70       75      F  65.000000
Jimmy    70       90       88      M  82.666667